tap "azure/functions"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "phase2/devtools"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Library for manipulating PNG images
brew "libpng"
# Portable Foreign Function Interface library
brew "libffi"
# Command-line interface for SQLite
brew "sqlite"
# Core application library for C
brew "glib"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq", restart_service: true
# Isolated development environments using Docker
brew "docker-compose", link: false
# Generic library support script
brew "libtool"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# GIF image/animation creator/editor
brew "gifsicle"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Image processing tools collection
brew "graphicsmagick"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Improved top (interactive process viewer)
brew "htop"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Postgres C API library
brew "libpq"
# Utility for directing compilation
brew "make"
# Run a Kubernetes cluster locally
brew "minikube"
# Open source relational database management system
brew "mysql"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Package for scientific computing with Python
brew "numpy"
# General-purpose scripting language
brew "php"
# General-purpose scripting language
brew "php@7.3"
# Object-relational database system
brew "postgresql"
# Object-relational database system
brew "postgresql@11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Software environment for statistical computing
brew "r"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Tool for building source and injecting into docker images
brew "source-to-image"
# Version control system designed to be a better CVS
brew "subversion"
# User interface to the TELNET protocol
brew "telnet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Azure Functions Core Tools 3.0
brew "azure/functions/azure-functions-core-tools@3"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Containerized platform environment for projects. See https://phase2.github.io/devtools for documentation. 
brew "phase2/devtools/devtools"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Tools for building Android applications
cask "android-studio"
# Application uninstaller
cask "appcleaner"
# Text editor
cask "atom"
# Utility to create and modify archives
cask "betterzip"
cask "blisk"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
cask "dbngin"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
cask "docker-toolbox"
cask "edex-ui"
cask "figma"
# Web browser
cask "firefox"
# Font manager
cask "fontbase"
# Desktop client for GitHub repositories
cask "github"
# Go (golang) IDE
cask "goland"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
cask "graphql-playground"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Diary app
cask "journey"
# Visual user interface for Docker Container management
cask "kitematic"
cask "leanote"
cask "manuscripts"
cask "mongodb-compass"
cask "moonitor"
cask "mtmr"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# App to write, plan, collaborate, and get organized
cask "notion"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
cask "postgres"
# GUI client for PostgreSQL databases
cask "postico"
# Collaboration platform for API development
cask "postman"
# Data science software focusing on R and Python
cask "rstudio"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Graphical client for Git version control
cask "sourcetree"
# Move and resize windows with ease
cask "spectacle"
# Music streaming service
cask "spotify"
cask "station"
# Native GUI tool for relational databases
cask "tableplus"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# Tool to display the local times of people in a team
cask "there"
# Open-source BitTorrent client
cask "transmission"
# Development environment
cask "vagrant"
cask "vagrant-manager"
# Visual editors for data
cask "valentina-studio"
# Free and open-source hosted hypervisor for x86 virtualization
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
# Temporary makeshift alias for the video communication tool Zoom
cask "zoomus"
